# Working With Dates



---

# Setup

In [2]:
## imports
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# Facebook Yahoo Stock Data


### Import the data FB.csv

Upload the file from Q-Tools `FB.csv` to your server/computer.  

> It is usually in the `Downloads` folder

> For those using `Colab`, you upload this file, which can be found on the left hand nav

In [3]:
## import the file
fb = pd.read_csv("/Users/Kyle_Staples/Documents/GitHub/IS834/datasets/FB.csv")

In [4]:
fb.head()

         Date       Open       High        Low      Close  Adj Close    Volume
0  2014-03-20  68.010002  68.230003  66.820000  66.970001  66.970001  44439000
1  2014-03-21  67.529999  67.919998  66.180000  67.239998  67.239998  59999900
2  2014-03-24  67.190002  67.360001  63.360001  64.099998  64.099998  85696000
3  2014-03-25  64.889999  66.190002  63.779999  64.889999  64.889999  68786000
4  2014-03-26  64.739998  64.949997  60.369999  60.389999  60.389999  97503900

In [5]:
## peak
fb.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1258 entries, 0 to 1257
Data columns (total 7 columns):
Date         1258 non-null object
Open         1258 non-null float64
High         1258 non-null float64
Low          1258 non-null float64
Close        1258 non-null float64
Adj Close    1258 non-null float64
Volume       1258 non-null int64
dtypes: float64(5), int64(1), object(1)
memory usage: 68.9+ KB

> Note that Date is a type called `object` .  We haven't talked about that yet, but its basically a string.  Let's summarize the data, and proove that Date is held out of the analysis.

In [6]:
fb.describe()

,Open,High,Low,Close,Adj Close,Volume
count,1258.000000,1258.000000,1258.000000,1258.000000,1258.000000,1.258000e+03
mean,124.406097,125.666002,123.096479,124.446852,124.446852,2.732384e+07
std,40.170832,40.497886,39.875461,40.223455,40.223455,1.810437e+07
min,55.900002,57.650002,54.660000,56.139999,56.139999,5.913100e+06
25%,84.154999,85.107500,83.270002,83.957502,83.957502,1.626702e+07
50%,121.444999,122.349998,120.160000,121.345001,121.345001,2.179780e+07
75%,161.975002,163.879997,160.325001,162.312503,162.312503,3.124252e+07
max,215.720001,218.619995,214.270004,217.500000,217.500000,1.698037e+08

#### We could parse the file into columns

In [0]:
## parse into month/day/year columns
fb.head(2)

In [7]:
## year
fb['year'] = fb['Date'].str.slice(0,4)
fb.head()

,Date,Open,High,Low,Close,Adj Close,Volume,year
0,2014-03-20,68.010002,68.230003,66.820000,66.970001,66.970001,44439000,2014
1,2014-03-21,67.529999,67.919998,66.180000,67.239998,67.239998,59999900,2014
2,2014-03-24,67.190002,67.360001,63.360001,64.099998,64.099998,85696000,2014
3,2014-03-25,64.889999,66.190002,63.779999,64.889999,64.889999,68786000,2014
4,2014-03-26,64.739998,64.949997,60.369999,60.389999,60.389999,97503900,2014

In [8]:
## month
fb['month'] = fb['Date'].str.slice(5,7)
fb.head()

,Date,Open,High,Low,Close,Adj Close,Volume,year,month
0,2014-03-20,68.010002,68.230003,66.820000,66.970001,66.970001,44439000,2014,03
1,2014-03-21,67.529999,67.919998,66.180000,67.239998,67.239998,59999900,2014,03
2,2014-03-24,67.190002,67.360001,63.360001,64.099998,64.099998,85696000,2014,03
3,2014-03-25,64.889999,66.190002,63.779999,64.889999,64.889999,68786000,2014,03
4,2014-03-26,64.739998,64.949997,60.369999,60.389999,60.389999,97503900,2014,03

In [9]:
## day -- note the     n:   syntax
fb['day'] = fb['Date'].str.slice(8)
fb.head()

,Date,Open,High,Low,Close,Adj Close,Volume,year,month,day
0,2014-03-20,68.010002,68.230003,66.820000,66.970001,66.970001,44439000,2014,03,20
1,2014-03-21,67.529999,67.919998,66.180000,67.239998,67.239998,59999900,2014,03,21
2,2014-03-24,67.190002,67.360001,63.360001,64.099998,64.099998,85696000,2014,03,24
3,2014-03-25,64.889999,66.190002,63.779999,64.889999,64.889999,68786000,2014,03,25
4,2014-03-26,64.739998,64.949997,60.369999,60.389999,60.389999,97503900,2014,03,26

## Why do this?

Now we can use these fields for summaries, or, to add a level of detail to the record that we ultimately want to summarize, like sales/month, or average sales by day, but it requires some work to summarize data on a date/time level.

We will come back to this as if we have the datetime, we can actually do this more explicitly, but a good exercise of parsing strings too.

# Parse Dates using Pandas

In [10]:
# create a new column with date parsed
fb['date2'] = pd.to_datetime(fb['Date'])

In [11]:
fb.head()

,Date,Open,High,Low,Close,Adj Close,Volume,year,month,day,date2
0,2014-03-20,68.010002,68.230003,66.820000,66.970001,66.970001,44439000,2014,03,20,2014-03-20
1,2014-03-21,67.529999,67.919998,66.180000,67.239998,67.239998,59999900,2014,03,21,2014-03-21
2,2014-03-24,67.190002,67.360001,63.360001,64.099998,64.099998,85696000,2014,03,24,2014-03-24
3,2014-03-25,64.889999,66.190002,63.779999,64.889999,64.889999,68786000,2014,03,25,2014-03-25
4,2014-03-26,64.739998,64.949997,60.369999,60.389999,60.389999,97503900,2014,03,26,2014-03-26

In [12]:
fb.dtypes

Date                 object
Open                float64
High                float64
Low                 float64
Close               float64
Adj Close           float64
Volume                int64
year                 object
month                object
day                  object
date2        datetime64[ns]
dtype: object

# Parse the date upon reading the file

In [13]:
# read in the same Facebook file
fb2 = pd.read_csv("/Users/Kyle_Staples/Documents/GitHub/IS834/datasets/FB.csv", parse_dates=['Date'])

In [14]:
fb2.dtypes

Date         datetime64[ns]
Open                float64
High                float64
Low                 float64
Close               float64
Adj Close           float64
Volume                int64
dtype: object

> Look at the help, there is a lot we can do with dates, but this is the core of it and will get you a long way most of the time.

> https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html

# Build a Date Range with `date_range`

In [15]:
N = 100
df = pd.DataFrame({'Date': pd.date_range(start="2019-01-01", periods=N, freq="D"),
                   'Value': np.random.randint(-10, 10, size=N)})

In [16]:
df.head()

        Date  Value
0 2019-01-01      6
1 2019-01-02      4
2 2019-01-03     -4
3 2019-01-04      7
4 2019-01-05      1

# Worth Noting - define the format for a date/time in String form

We can also specify the format of the string 

http://strftime.org/

> Above is also in the cheatsheets folder for the course site

In [18]:
# bring in Facebook again, but explicitly define the format
fb3 = pd.read_csv("/Users/Kyle_Staples/Documents/GitHub/IS834/datasets/FB.csv")

In [19]:
fb3.dtypes

Date          object
Open         float64
High         float64
Low          float64
Close        float64
Adj Close    float64
Volume         int64
dtype: object

In [20]:
fb3.head(1)

         Date       Open       High    Low      Close  Adj Close    Volume
0  2014-03-20  68.010002  68.230003  66.82  66.970001  66.970001  44439000

In [21]:
# parse the date with explicit format
fb3['date'] = pd.to_datetime(fb3['Date'], format="%Y-%m-%d")

In [22]:
fb3.head()

,Date,Open,High,Low,Close,Adj Close,Volume,date
0,2014-03-20,68.010002,68.230003,66.820000,66.970001,66.970001,44439000,2014-03-20
1,2014-03-21,67.529999,67.919998,66.180000,67.239998,67.239998,59999900,2014-03-21
2,2014-03-24,67.190002,67.360001,63.360001,64.099998,64.099998,85696000,2014-03-24
3,2014-03-25,64.889999,66.190002,63.779999,64.889999,64.889999,68786000,2014-03-25
4,2014-03-26,64.739998,64.949997,60.369999,60.389999,60.389999,97503900,2014-03-26



---

In [23]:
# we can do this with other date formats
tmp_data = {'a':['01/01/2019'], 'b':['Tuesday Jan 1, 19'], 'c':['2019-03-20 18:30:25']}
more_parsing = pd.DataFrame(tmp_data)
more_parsing

            a                  b                    c
0  01/01/2019  Tuesday Jan 1, 19  2019-03-20 18:30:25

In [24]:
# different ways to parse
more_parsing["dmy"] = pd.to_datetime(more_parsing['a'], format="%d/%m/%Y")
more_parsing

            a                  b                    c        dmy
0  01/01/2019  Tuesday Jan 1, 19  2019-03-20 18:30:25 2019-01-01

In [25]:
# mdy
more_parsing["mdy"] = pd.to_datetime(more_parsing['a'], format="%m/%d/%Y")
more_parsing

            a                  b                    c        dmy        mdy
0  01/01/2019  Tuesday Jan 1, 19  2019-03-20 18:30:25 2019-01-01 2019-01-01

In [26]:

# more detailed parsing
more_parsing['parsed'] = pd.to_datetime(more_parsing['b'], format="%A %b %d, %y")
more_parsing

,a,b,c,dmy,mdy,parsed
0,01/01/2019,"Tuesday Jan 1, 19",2019-03-20 18:30:25,2019-01-01,2019-01-01,2019-01-01

In [27]:
# finally, its not just dates, but dates and times
more_parsing['datetime'] = pd.to_datetime(more_parsing['c'], format="%Y-%m-%d %H:%M:%S")
more_parsing

,a,b,c,dmy,mdy,parsed,datetime
0,01/01/2019,"Tuesday Jan 1, 19",2019-03-20 18:30:25,2019-01-01,2019-01-01,2019-01-01,2019-03-20 18:30:25

In [28]:
more_parsing.dtypes

a                   object
b                   object
c                   object
dmy         datetime64[ns]
mdy         datetime64[ns]
parsed      datetime64[ns]
datetime    datetime64[ns]
dtype: object

# Extract Components of the Date/time

In [29]:
# use the df dataframe
df.head()

        Date  Value
0 2019-01-01      6
1 2019-01-02      4
2 2019-01-03     -4
3 2019-01-04      7
4 2019-01-05      1

In [30]:
# extract out the day value
df['day'] = df['Date'].dt.day
df.head()

        Date  Value  day
0 2019-01-01      6    1
1 2019-01-02      4    2
2 2019-01-03     -4    3
3 2019-01-04      7    4
4 2019-01-05      1    5

In [0]:
# extact out the month and year
df['month'] = df['Date'].dt.month
df['year'] = df['Date'].dt.year
df.tail()

In [0]:
# even parse out times -- use more_parsing from above
more_parsing['hour'] = more_parsing['datetime'].dt.hour
more_parsing

In [0]:
# to round on the parsing
more_parsing['minute'] = more_parsing['datetime'].dt.minute
more_parsing['second'] = more_parsing['datetime'].dt.second
more_parsing